from collections import ChainMap

# Uncomment only what you need
morph_features: dict[str, dict[str, str]] = {
    'часть речи': {
        'сущ'   : 'Nn',
        'прл'   : 'Ad',
        'гл'    : 'Vb',
        'нар'   : 'Av',
        'мест'  : 'Pn',
        'числ'  : 'Nu',
        'прч'   : 'Pc',
        'дееп'  : 'Tg',
        'межд'  : 'Ij',
        'предл' : 'Pp',
        'союз'  : 'Cj',
        'част'  : 'Pi',
        'предик': 'Pd',
        'ввод'  : 'Ph',
    },
    # 'падеж': {
    #     'нескл' : 'Id',
    #     'им'    : 'No',
    #     'род'   : 'Ge',
    #     'дат'   : 'Da',
    #     'вин'   : 'Ac',
    #     'тв'    : 'In',
    #     'пр'    : 'Lo',
    #     'парт'  : 'Pa',
    #     'счет'  : 'Cn',
    #     'зват'  : 'Vo',
    # },
    # 'число': {
    #     'ед'    : 'Sg',
    #     'мн'    : 'Pl',
    # },
    # 'род': {
    #     'муж'   : 'Ma',
    #     'жен'   : 'Fe',
    #     'ср'    : 'Ne',
    #     'общ'   : 'Co',
    # },
    # 'одушевлённость': {
    #     'неод'  : 'Ia',
    #     'одуш'  : 'An',
    # },
    # 'форма прилигательного': {
    #     'крат'  : 'Br',
    #     'сравн' : 'Cm',
    #     'прев'  : 'Sl',
    #     'неизм' : 'Al',
    # },
    # 'форма глагола': {
    #     'инф'   : 'If',
    #     'пов'   : 'Ip',
    #     'прош'  : 'Pt',
    #     'наст'  : 'Pr',
    #     'буд'   : 'Fu',
    # },
    # 'лицо': {
    #     '1-е'   : '1p',
    #     '2-е'   : '2p',
    #     '3-е'   : '3p',
    # },
    # 'вид': {
    #     'несов' : 'Im',
    #     'сов'   : 'Pf',
    #     '2вид'  : 'Ba',
    # },
    # 'безличность': {
    #     'безл'  : 'Il',
    # },
    # 'переходность': {
    #     'непер' : 'It',
    #     'воз'   : 'Rf',
    #     'перех' : 'Tr',
    #     'пер/не': 'Ti',
    # },
    # 'залог': {
    #     'страд' : 'Pv',
    # },
    # 'тип числительного': {
    #     'неопр' : 'Ie',
    #     'кол'   : 'Cr',
    #     'поряд' : 'Or',
    #     'собир' : 'Cl',
    # },
    # 'тип наречия': {
    #     'вопр'  : 'Qs',
    #     'опред' : 'Df',
    #     'обст'  : 'Aj',
    #     'кач'   : 'Qu',
    #     'спос'  : 'Md',
    #     'степ'  : 'Dg',
    #     'врем'  : 'Tm',
    #     'места' : 'Lc',
    #     'напр'  : 'Dr',
    #     'причин': 'Cs',
    #     'цель'  : 'Oj',
    # },
}

morph_abbr = dict(ChainMap(*morph_features.values()))
